tap 'leoafarias/fvm'
tap 'manaflow-ai/cmux'
tap 'oven-sh/bun'
tap 'schpet/tap'

# Utilities
brew 'autoconf'
brew 'automake'
brew 'bison'
brew 'freetype'
brew 'gd'
brew 'gettext'
brew 'gmp'
brew 'jq'
brew 'bats-core'
brew 'libyaml'
brew 'openssl@3'
brew 'pkg-config'
brew 're2c'
brew 'zlib'
brew 'pwgen'
brew 'qpdf'

# Shell & Terminal
brew 'fzf'
brew 'mise'

# Git & Version Control
brew 'gh'
brew 'ghq'
brew 'lazygit'
brew 'lazydocker'
brew 'worktrunk'

# Cloud & DevOps
brew 'kubectl'
brew 'kubectx'
brew 'stern'
brew 'sops'

# Languages & Runtimes
brew 'oven-sh/bun/bun'
brew 'leoafarias/fvm/fvm'
brew 'pipx'

# Network & API
brew 'grpcurl'
brew 'tailscale'

# Task Management
brew 'schpet/tap/linear'

# AI Tooling
brew 'rtk'

# Other
brew 'mas'

# Casks
cask '1password'
cask 'amazon-photos'
cask 'android-studio'
cask 'claude-code'
cask 'cmux'
cask 'contexts'
cask 'cursor'
cask 'docker-desktop'
cask 'dropbox'
cask 'figma'
cask 'linear-linear'
cask 'flutter'
cask 'google-chrome'
cask 'gcloud-cli'
cask 'google-japanese-ime'
cask 'medis'
cask 'notion'
cask 'orbstack'
cask 'postman'
cask 'raycast'
cask 'slack'
cask 'tableplus'
cask 'visual-studio-code'
cask 'zoom'

# Fonts
cask 'font-sf-mono'

# Mac App Store
mas 'LINE', id: 539883307
mas 'Magnet', id: 441258766
mas 'TestFlight', id: 899247664
mas 'Apple Developer', id: 640199958
mas 'Transporter', id: 1450874784
# Xcode は macOS バージョン依存が強いため手動管理
# mas 'Xcode', id: 497799835
